trade_exp/src/InformationRegisters/АналогиНоменклатуры/АналогиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8fdb01f6-4967-4863-8211-300891e04633">
  <name>АналогиНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="5101c189-e0d9-4d7a-ad43-75fe9ff7c368">
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c8b16b72-9107-42cd-bc6b-e7ed0308c512">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ed55715d-dbff-4f56-9d3f-c1366a117f76">
    <name>ОбратнаяАналогия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="56dd2c22-0fcc-4868-b308-1d6f8a56ed55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ed23a32e-e185-4b37-b18e-204672040e54">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8754e396-036b-4c70-867f-6bf8ed950029">
    <name>АналогНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="26f13074-bd31-45ce-8888-d525330b5e0b">
    <name>АналогХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ef115090-8fca-4521-9bd1-ecc07f568bec">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3a3a65ce-80a9-435f-9aa2-21d5add59229">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ABCКлассификацияНоменклатуры_Альтерра/ABCКлассификацияНоменклатуры_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ABCКлассификацияНоменклатуры_Альтерра</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Класс</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="80d8f3a4-6b7b-4718-8ee3-b7242a527914">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/InformationRegisters/АналогиНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьАналогиНоменклатуры(Номенклатура,ВидЦены,Склад) Экспорт
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос; 
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	АналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры,
			|	МАКСИМУМ(АналогиНоменклатуры.Приоритет) КАК Приоритет
			|ПОМЕСТИТЬ ВТ_Аналоги
			|ИЗ
			|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
			|ГДЕ
			|	АналогиНоменклатуры.Номенклатура = &Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	АналогиНоменклатуры.АналогНоменклатуры
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	АналогНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Аналоги.АналогНоменклатуры КАК АналогНоменклатуры,
			|	ВТ_Аналоги.Приоритет КАК Приоритет,
			|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Ссылка
			|ПОМЕСТИТЬ ВТ_АналогиХарактеристики
			|ИЗ
			|	ВТ_Аналоги КАК ВТ_Аналоги
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			|		ПО ВТ_Аналоги.АналогНоменклатуры = ХарактеристикиНоменклатуры.Владелец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК Остаток,
			|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0)) КАК Доступно,
			|	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК Цена,
			|	ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Класс КАК Класс,
			|	ВТ_АналогиХарактеристики.АналогНоменклатуры КАК АналогНоменклатуры,
			|	ВТ_АналогиХарактеристики.Приоритет КАК Приоритет
			|ПОМЕСТИТЬ ВТ_ДанныеАналогов
			|ИЗ
			|	ВТ_АналогиХарактеристики КАК ВТ_АналогиХарактеристики
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ВТ_АналогиХарактеристики.АналогНоменклатуры = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ВТ_АналогиХарактеристики.Ссылка = ЦеныНоменклатурыСрезПоследних.Характеристика
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ABCКлассификацияНоменклатуры_Альтерра.СрезПоследних(, Подразделение = &Подразделение) КАК ABCКлассификацияНоменклатуры_АльтерраСрезПоследних
			|		ПО ВТ_АналогиХарактеристики.АналогНоменклатуры = ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
			|			ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
			|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК ВНаличииОстаток,
			|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Свободно,
			|			СУММА(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Резерв
			|		ИЗ
			|			РегистрНакопления.ЗапасыИПотребности.Остатки(
			|					,
			|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|						И Склад = &Склад) КАК ЗапасыИПотребностиОстатки
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЗапасыИПотребностиОстатки.Номенклатура,
			|			ЗапасыИПотребностиОстатки.Характеристика) КАК СвободныеОстаткиОстатки
			|		ПО ВТ_АналогиХарактеристики.АналогНоменклатуры = СвободныеОстаткиОстатки.Номенклатура
			|			И ВТ_АналогиХарактеристики.Ссылка = СвободныеОстаткиОстатки.Характеристика
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК ТоварыКОтгрузкеОстатки
			|		ПО ВТ_АналогиХарактеристики.АналогНоменклатуры = ТоварыКОтгрузкеОстатки.Номенклатура
			|			И ВТ_АналогиХарактеристики.Ссылка = ТоварыКОтгрузкеОстатки.Характеристика
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_АналогиХарактеристики.АналогНоменклатуры,
			|	ВТ_АналогиХарактеристики.Приоритет,
			|	ABCКлассификацияНоменклатуры_АльтерраСрезПоследних.Класс
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДанныеАналогов.АналогНоменклатуры КАК Номенклатура,
			|	ВТ_ДанныеАналогов.Остаток КАК Остаток,
			|	ВТ_ДанныеАналогов.Доступно КАК Доступно,
			|	ВТ_ДанныеАналогов.Цена КАК Цена,
			|	ВТ_ДанныеАналогов.Класс КАК Класс,
			|	ВТ_ДанныеАналогов.Приоритет КАК Приоритет,
			|	ВТ_ДанныеАналогов.АналогНоменклатуры.ПометкаУдаления КАК ПометкаУдаления,
			|	ВТ_ДанныеАналогов.АналогНоменклатуры.Код КАК Код,
			|	&Склад КАК Склад,
			|	&ВидЦены КАК ВидЦены,
			|	ВТ_ДанныеАналогов.АналогНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ИСТИНА КАК ЭтоТовар,
			|	ЛОЖЬ КАК ЭтоУслуга,
			|	ЛОЖЬ КАК ЭтоГруппа,
			|	ВТ_ДанныеАналогов.АналогНоменклатуры.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать) КАК ХарактеристикиИспользуются
			|ИЗ
			|	ВТ_ДанныеАналогов КАК ВТ_ДанныеАналогов
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет";
			
		Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Подразделение", Склад.Подразделение);
		Запрос.УстановитьПараметр("Склад", Склад);
		
		РезультатЗапроса = Новый ТаблицаЗначений;
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Возврат РезультатЗапроса;
		
КонецФункции	
	
Функция ЕстьАналогСТемжеПриоритетом(ТекЗапись) Экспорт 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналогиНоменклатуры.Номенклатура КАК Номенклатура,
		|	АналогиНоменклатуры.Характеристика КАК Характеристика,
		|	АналогиНоменклатуры.АналогНоменклатуры КАК АналогНоменклатуры,
		|	АналогиНоменклатуры.АналогХарактеристики КАК АналогХарактеристики,
		|	АналогиНоменклатуры.Кратность КАК Кратность,
		|	АналогиНоменклатуры.Приоритет КАК Приоритет,
		|	АналогиНоменклатуры.ОбратнаяАналогия КАК ОбратнаяАналогия
		|ИЗ
		|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|ГДЕ
		|	АналогиНоменклатуры.Номенклатура = &Номенклатура
		|	И АналогиНоменклатуры.Характеристика = &Характеристика
		|	И АналогиНоменклатуры.Приоритет = &Приоритет";
		
		Запрос.УстановитьПараметр("Номенклатура", ТекЗапись.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", ТекЗапись.Характеристика);
		Запрос.УстановитьПараметр("Приоритет", ТекЗапись.Приоритет);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Возврат ?(ВыборкаДетальныеЗаписи.Количество() = 0, Ложь, Истина);
КонецФункции
	
#КонецЕсли
